{
  "summary": "Olá, tudo bem? Seja bem-vindo ao meu 'jardim digital'. Me chamo Caio, sou desenvolvedor Backend e atualmente atuo como Tech Lead. Sou apaixonado por tecnologia e adoro explorar novas inovações. No meu tempo livre, gosto de ler sobre astronomia, acampar e jogar alguns games.",
  "text": "<p>Como já sabem, sou desenvolvedor backend, e aqui vou compartilhar um pouco mais sobre a minha trajetória profissional e quem eu sou como pessoa.</p> <p>Trabalho com desenvolvimento desde 2017, quando iniciei minha carreira como desenvolvedor Java. Com o tempo, fui migrando para a linguagem PHP (não me julguem, mas como dizem, a melhor linguagem é aquela que paga os boletos! 😅 Brincadeiras à parte, hoje é a linguagem que mais domino e com a qual tenho mais experiência. Consigo desenvolver desde sistemas utilizando PHP puro até frameworks como Laravel e Lumen, atuando tanto em sistemas monolíticos quanto em microserviços utilizando estrutura de mensageria). Já me aventurei no desenvolvimento full stack e tenho experiência com Angular e Vue, mas confesso que tenho minhas desavenças com CSS, rs. Também já desenvolvi em Ionic. Acho que já perceberam que gosto de trabalhar com stacks menos populares!</p> <p>Abaixo, há uma seção dedicada às minhas experiências profissionais, e você pode acessar uma página especial onde estão alguns dos projetos nos quais já participei, além de alguns projetos pessoais.</p> <p>Apesar de PHP ser a linguagem que mais utilizo, minha linguagem favorita é Python. Admiro a variedade de bibliotecas disponíveis e a facilidade com que podemos criar e testar modelos nessa linguagem. Atualmente, estou estudando C# com o objetivo de desenvolver um jogo, mais por entretenimento e aprendizado do que por outro motivo.</p> <p>Agora falando um pouco mais sobre mim, o ser humano: sou apaixonado por games, especialmente jogos single-player com campanhas imersivas, que acabam me entretendo mais. Mas também gosto de multiplayer, principalmente quando jogado com amigos, onde sempre rola uma boa resenha e ajuda a socializar. Além disso, sou entusiasta de astronomia – não sou nenhum expert, mas fico fascinado com a grandiosidade do universo.</p> <p>Um fato interessante sobre mim é que sou desbravador, uma espécie de 'escoteiro' em um projeto social da Igreja Adventista do Sétimo Dia (IASD). Gosto de acampar e me envolver em ações solidárias, o que me ajuda a desconectar e recarregar as energias.</p>"
}
