[
  {
    "startMonth": "Dez",
    "startYear": "2023",
    "endMonth": "Presente",
    "endYear": "",
    "title": "Software Engineer",
    "company": "Alares Internet",
    "description": "Desenvolvimento de soluções backend escaláveis com PHP (Laravel, Lumen) e Node.js (NestJS). Entrega de um CRM B2B completo, plataforma de comunicação assíncrona com RabbitMQ e SQS, e sistema de roteirização de atendimentos. Integrações com APIs externas, uso de Docker, GitHub Actions e observabilidade com Grafana e Elastic.",
    "summary": "Desenvolvimento de sistemas de comunicação, roteirização e CRM B2B com foco em performance, escalabilidade e integrações."
  },
  {
    "startMonth": "Fev",
    "startYear": "2023",
    "endMonth": "Dez",
    "endYear": "2023",
    "title": "Software Engineer",
    "company": "Webby Internet",
    "description": "Desenvolvimento backend de plataformas internas com PHP (Laravel) e Node.js. Projetos entregues: PDV CRM (vendas), Inside (gestão interna), Nimbus (documentação de rede). Implementações com Redis, RabbitMQ e filas assíncronas. Deploy com Docker e ambientes versionados.",
    "summary": "Desenvolvimento backend de sistemas internos como CRM, gestão de processos e automações operacionais."
  },
  {
    "startMonth": "Ago",
    "startYear": "2021",
    "endMonth": "Jan",
    "endYear": "2023",
    "title": "Full Stack Developer",
    "company": "Webby Internet",
    "description": "Desenvolvimento de um CRM integrado com PHP (Laravel), Angular e Ionic. Criação de plataforma para compartilhamento seguro de dashboards Power BI. Participação em projetos do levantamento até o deploy, com foco em performance, usabilidade e integração com serviços externos.",
    "summary": "Desenvolvimento full stack de CRM e solução de BI, unificando atendimento, vendas e relatórios."
  },
  {
    "startMonth": "Abr",
    "startYear": "2021",
    "endMonth": "Jul",
    "endYear": "2021",
    "title": "Backend Intern",
    "company": "Webby Internet",
    "description": "Suporte ao desenvolvimento do sistema PDV (CRM de vendas) com Laravel e Angular. Apoio em deploys com Docker e criação de funcionalidades iniciais para sistemas internos. Primeira vivência prática com desenvolvimento backend estruturado.",
    "summary": "Estágio com foco em backend, apoiando o desenvolvimento do sistema PDV e automações internas."
  },
  {
    "startMonth": "Jan",
    "startYear": "2017",
    "endMonth": "Ago",
    "endYear": "2017",
    "title": "Java Developer Intern",
    "company": "Sigma Dataserv Informática S/A",
    "description": "Desenvolvimento e manutenção de sistemas públicos com Java (Struts, JSP, JSF). Atuação em projetos de gestão escolar e penitenciária, seguindo padrões MVC. Refatoração de código legado e entrega de funcionalidades para plataformas públicas.",
    "summary": "Desenvolvimento Java em sistemas educacionais e penitenciários com frameworks JSF e Struts."
  },
  {
    "startMonth": "Ago",
    "startYear": "2016",
    "endMonth": "Dez",
    "endYear": "2016",
    "title": "Systems Support Intern",
    "company": "MSI Soluções",
    "description": "Atendimento e suporte técnico a clientes de ERP. Resolução de problemas SQL, treinamento de usuários e documentação de processos. Contato direto com a base de usuários para análise de erros recorrentes e sugestões de melhoria.",
    "summary": "Suporte técnico a sistemas ERP, com foco em SQL, documentação e atendimento ao cliente."
  }
]